Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: The REST Client internally uses https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClient.html[the Vert.x HTTP Client] to make the network connections. The REST Client extensions allows configuring some settings via properties, for example:
ja_jp: REST Client は、内部的に https://vertx.io/docs/apidocs/io/vertx/core/http/HttpClient.html[Vert.x HTTP Client] を使用して、ネットワーク接続をします。REST Client Reactive エクステンションでは、プロパティーを使っていくつかの設定を行うことができます。以下に例を示します。

source: The REST Client is capable of sending arbitrarily large HTTP bodies without buffering the contents in memory, if one of the following types is used:
ja_jp: REST Client は、以下のいずれかの型を使用する場合、メモリー内にコンテンツをバッファーリングすることなく、任意の大きさの HTTP 本文を送信できます。

source: The REST Client supports `@JsonView` both for sending content to the REST API and for retrieving data from it:
ja_jp: REST Client は、REST API へのコンテンツの送信と、REST API からのデータ取得の両方で `@JsonView` をサポートします。

source: The REST Client supports adding a custom ObjectMapper to be used only the Client using the annotation `@ClientObjectMapper`.
ja_jp: REST Client は、 `@ClientObjectMapper` アノテーションを使用して、クライアント専用のカスタム ObjectMapper を追加することをサポートします。

source: The REST Client supports further customization of the final request to be sent to the server via filters. The filters must implement either the interface `ClientRequestFilter` or `ResteasyReactiveClientRequestFilter`.
ja_jp: REST Client は、フィルターを介してサーバーに送信される最終リクエストのさらなるカスタマイズをサポートします。フィルターは、インターフェイス `ClientRequestFilter` または `ResteasyReactiveClientRequestFilter` のいずれかを実装する必要があります。

source: The REST Client uses the Vert.x HTTP connection pool with a default size of `50` in order to minimize the necessary HTTP connections being used against the target REST services. While this is a reasonable default, it might be too limiting for specific scenarios. In such cases, the `quarkus.rest-client."some-client".connection-pool-size` configuration property can be used.
ja_jp: REST Client は、ターゲット REST サービスに対して使用される必要な HTTP 接続を最小限に抑えるため、デフォルトサイズ `50` の Vert.x HTTP 接続プールを使用します。これは妥当なデフォルトですが、特定のシナリオでは制限が厳しすぎる場合があります。そのような場合、`quarkus.rest-client."some-client".connection-pool-size` 設定プロパティーを使用できます。

source: The REST client allows for a per invocation override of the base URL using the `io.quarkus.rest.client.reactive.Url` annotation.
ja_jp: REST クライアントでは、 `io.quarkus.rest.client.reactive.Url` アノテーションを使用して、呼び出しごとにベース URL をオーバーライドできます。

source: The REST endpoint `/hello/basic-and-code-flow` can be accessed only if both the xref:security-oidc-code-flow-authentication.adoc[OIDC authorization code flow mechanism] and the <<basic-auth>> have successfully provided `SecurityIdentity`.
ja_jp: REST エンドポイント `/hello/basic-and-code-flow` は、xref:security-oidc-code-flow-authentication.adoc[OIDC 認可コードフローメカニズム] と <<basic-auth>> の両方が `SecurityIdentity` を正常に提供した場合にのみアクセスできます。

source: The REST endpoint `/hello/basic-and-code-flow` uses both the xref:security-oidc-code-flow-authentication.adoc[OIDC authorization code flow mechanism] and the <<basic-auth>>. Access is granted if at least one of them successfully provides `SecurityIdentity`.
ja_jp: REST エンドポイント `/hello/basic-and-code-flow` は、xref:security-oidc-code-flow-authentication.adoc[OIDC 認可コードフローメカニズム] と <<basic-auth>> の両方を使用します。少なくともどちらか一方が `SecurityIdentity` を正常に提供した場合にアクセスが許可されます。

source: The REST endpoint `/hello/basic-bearer` can be accessed either by using the xref:security-oidc-bearer-token-authentication.adoc[OIDC bearer token authentication mechanism], or by using the <<basic-auth>>.
ja_jp: REST エンドポイント `/hello/basic-bearer` には、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証メカニズム] または <<basic-auth>> のいずれかを使用してアクセスできます。

source: The REST endpoint `/hello/basic-bearer` can be accessed only if both the xref:security-oidc-bearer-token-authentication.adoc[OIDC bearer token authentication mechanism] and the <<basic-auth>> have successfully provided `SecurityIdentity`.
ja_jp: REST エンドポイント `/hello/basic-bearer` には、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証メカニズム] と <<basic-auth>> の両方が `SecurityIdentity` を正常に提供した場合にのみアクセスできます。

source: The REST endpoint `/hello/basic-bearer` uses both the xref:security-oidc-bearer-token-authentication.adoc[OIDC bearer token authentication mechanism] and the <<basic-auth>>. Access is granted if at least one of them successfully provides `SecurityIdentity`.
ja_jp: REST エンドポイント `/hello/basic-bearer` は、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証メカニズム] と <<basic-auth>> の両方を使用します。いずれかが `SecurityIdentity` を正常に提供すればアクセスが許可されます。

source: The REST endpoint `/hello/basic-or-code-flow` can be accessed either by using the xref:security-oidc-code-flow-authentication.adoc[OIDC authorization code flow mechanism], or by using the <<basic-auth>>.
ja_jp: REST エンドポイント `/hello/basic-or-code-flow` には、xref:security-oidc-code-flow-authentication.adoc[OIDC 認可コードフローメカニズム] または <<basic-auth>> のいずれかを使用してアクセスできます。

source: The REST endpoint `/hello/basic` can only ever be accessed by using the <<basic-auth>>.
ja_jp: REST エンドポイント `/hello/basic` には、<<basic-auth>> を使用する場合のみアクセスできます。

source: The REST endpoint `/hello/bearer` can only ever be accessed by using the xref:security-oidc-bearer-token-authentication.adoc[OIDC bearer token authentication mechanism].
ja_jp: REST エンドポイント `/hello/bearer` には、xref:security-oidc-bearer-token-authentication.adoc[OIDC ベアラー認証メカニズム] を使用する場合のみアクセスできます。

source: The REST endpoint `/hello/code-flow` can only ever be accessed by using the xref:security-oidc-code-flow-authentication.adoc[OIDC authorization code flow mechanism].
ja_jp: REST エンドポイント `/hello/code-flow` には、xref:security-oidc-code-flow-authentication.adoc[OIDC 認可コードフローメカニズム] を使用する場合のみアクセスできます。

source: The REST endpoint `/hello/custom` can only ever be accessed by using a custom `HttpAuthenticationMechanism` with a `custom` authentication scheme.
ja_jp: REST エンドポイント `/hello/custom` には、`custom` 認証スキームを持つカスタム `HttpAuthenticationMechanism` を使用する場合のみアクセスできます。

source: The REST layer is implemented using https://quarkus.io/guides/resteasy-reactive[RESTEasy Reactive^] with blocking endpoints. Data is persisted into a https://www.postgresql.org[PostgreSQL^] database. The Villain service also creates some custom configurations which show how to use https://quarkus.io/guides/config-mappings[`+ConfigMapping+`^] objects. Additionally, the Villain service favors https://quarkus.io/guides/cdi-reference#qualified-injected-fields[field injection^] of beans over https://quarkus.io/guides/cdi-reference#simplified-constructor-injection[constructor injection^]. The Villain service contains a full suite of unit and integration tests, using https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[mocking^], https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[spying^], and testing within https://quarkus.io/guides/getting-started-testing#tests-and-transactions[isolated transactions^].
ja_jp: REST層は、 link:https://quarkus.io/guides/resteasy-reactive[RESTEasy Reactive, window=_blank]を使って、ブロック型のエンドポイントで実装されています。データは link:https://www.postgresql.org[PostgreSQL, window=_blank]データベースに保存されます。Villainサービスはまた、いくつかのカスタム設定を作成して、どのように link:https://quarkus.io/guides/config-mappings[`ConfigMapping`, window=_blank]オブジェクトを使うかを示すカスタム設定も作成します。さらに、Villainサービスは link:https://quarkus.io/guides/cdi-reference#simplified-constructor-injection[コンストラクタ・インジェクション, window=_blank]よりもビーンの link:https://quarkus.io/guides/cdi-reference#qualified-injected-fields[フィールド・インジェクション, window=_blank]を好みます。Villainサービスはユニットテストと統合テストの完全なスイートを含み、 link:https://quarkus.io/guides/getting-started-testing#further-simplification-with-injectmock[モッキング, window=_blank]、 link:https://quarkus.io/guides/getting-started-testing#using-spies-instead-of-mocks-with-injectspy[スパイ, window=_blank]、 link:https://quarkus.io/guides/getting-started-testing#tests-and-transactions[隔離された, window=_blank]トランザクション内でのテストを用います。

source: The RESTEasy Classic context
ja_jp: RESTEasy Classic コンテキスト

source: The RESTEasy Reactive endpoint security checks are performed before xref:cdi.adoc#interceptors[CDI interceptors] are invoked. The safest approach to log Quarkus Security authentication exceptions is to ensure that proactive authentication is enabled and to use Vert.x HTTP route failure handlers. For more information, see the xref:security-proactive-authentication.adoc#customize-auth-exception-responses[Customize authentication exception responses] section of the Proactive authentication guide.
ja_jp: RESTEasy Reactive エンドポイントのセキュリティチェックは、 xref:cdi.adoc#interceptors[CDI インターセプタ] が呼び出される前に実行されます。 Quarkus Securityの認証例外をログに記録する最も安全な方法は、プロアクティブ認証が有効になっていることを確認し、Vert.x HTTPルート失敗ハンドラを使用することです。 詳細については、プロアクティブ認証ガイドの xref:security-proactive-authentication.adoc#customize-auth-exception-responses[認証例外応答のカスタマイズ] のセクションを参照してください。

source: The RESTEasy Reactive extension is added automatically only if you ask for codestarts and you didn't specify any extensions.
ja_jp: RESTEasy Reactiveエクステンションは、コードスタートを依頼し、エクステンションを指定しなかった場合のみ、自動的に追加されます。

source: The RESTEasy Reactive or RESTEasy Classic context
ja_jp: RESTEasy ReactiveまたはRESTEasy Classicのコンテキスト

source: The RESTEasy extension doesn't support the method `getProperties()` of the class `jakarta.ws.rs.core.Application`. Moreover, it only relies on the methods `getClasses()` and `getSingletons()` to filter out the annotated resource, provider, and feature classes. It does not filter out the built-in resource, provider, and feature classes and also the resource, provider, and feature classes registered by the other extensions. Finally, the objects returned by the method `getSingletons()` are ignored, only the classes are taken into account to filter out the resource, provider and feature classes, in other words the method `getSingletons()` is managed the same way as `getClasses()`.
ja_jp: RESTEasy エクステンションは、クラス `jakarta.ws.rs.core.Application` のメソッド `getProperties()` をサポートしていません。 さらに、メソッド `getClasses()` および `getSingletons()` のみに依存して、アノテーションが付けられたリソース、プロバイダー、および機能クラスをフィルタリングします。 組み込みのリソース、プロバイダー、機能クラスや、他のエクステンションで登録されたリソース、プロバイダ、機能クラスは除外されません。 最後に、メソッド `getSingletons()` が返すオブジェクトは無視され、リソース、プロバイダー、機能クラスをフィルタリングするためにクラスのみが考慮されます。言い換えれば、メソッド `getSingletons()` は実際には `getClasses()` と同じように管理されます。

source: The RESTEasy extension doesn't support the method `getProperties()` of the class `jakarta.ws.rs.core.Application`. Moreover, it only relies on the methods `getClasses()` and `getSingletons()` to filter out the annotated resource, provider and feature classes. It doesn't filter out the built-in resource, provider and feature classes and also the resource, provider and feature classes registered by the other extensions. Finally, the objects returned by the method `getSingletons()` are ignored, only the classes are taken into account to filter out the resource, provider and feature classes, in other words the method `getSingletons()` is actually managed the same way as `getClasses()`.
ja_jp: RESTEasyエクステンションは、クラス `jakarta.ws.rs.core.Application` のメソッド `getProperties()` をサポートしていません。さらに、アノテーションされたリソース、プロバイダ、フィーチャークラスをフィルタリングするために、 `getClasses()` と `getSingletons()` のメソッドにのみ依存しています。組み込みのリソース、プロバイダ、機能クラスや、他のエクステンションで登録されたリソース、プロバイダ、機能クラスは除外されません。最後に、メソッド `getSingletons()` が返すオブジェクトは無視され、リソース、プロバイダ、機能クラスをフィルタリングするためにクラスのみが考慮されます。言い換えれば、メソッド `getSingletons()` は実際には `getClasses()` と同じように管理されます。

source: The RESTEasy extension doesn't support the method `getProperties()` of the class `javax.ws.rs.core.Application`. Moreover, it only relies on the methods `getClasses()` and `getSingletons()` to filter out the annotated resource, provider and feature classes. It doesn't filter out the built-in resource, provider and feature classes and also the resource, provider and feature classes registered by the other extensions. Finally the objects returned by the method `getSingletons()` are ignored, only the classes are took into account to filter out the resource, provider and feature classes, in other words the method `getSingletons()` is actually managed the same way as `getClasses()`.
ja_jp: RESTEasyエクステンションは、クラス `javax.ws.rs.core.Application` のメソッド `getProperties()` をサポートしていません。さらに、アノテーションされたリソース、プロバイダ、フィーチャークラスをフィルタリングするために、 `getClasses()` と `getSingletons()` のメソッドにのみ依存しています。組み込みのリソース、プロバイダ、機能クラスや、他のエクステンションで登録されたリソース、プロバイダ、機能クラスは除外されません。最後に、メソッド `getSingletons()` が返すオブジェクトは無視され、リソース、プロバイダ、機能クラスをフィルタリングするためにクラスのみが考慮されます。言い換えれば、メソッド `getSingletons()` は実際には `getClasses()` と同じように管理されます。

source: The RESTEasy extension doesn't support the method `getProperties()` of the class `javax.ws.rs.core.Application`. Moreover, it only relies on the methods `getClasses()` and `getSingletons()` to filter out the annotated resource, provider and feature classes. It doesn't filter out the built-in resource, provider and feature classes and also the resource, provider and feature classes registered by the other extensions. Finally, the objects returned by the method `getSingletons()` are ignored, only the classes are taken into account to filter out the resource, provider and feature classes, in other words the method `getSingletons()` is actually managed the same way as `getClasses()`.
ja_jp: RESTEasy エクステンションは、クラス `javax.ws.rs.core.Application` のメソッド `getProperties()` をサポートしていません。さらに、アノテーションされたリソース、プロバイダー、機能クラスをフィルタリングするために、 `getClasses()` と `getSingletons()` のメソッドにのみ依存しています。組み込みのリソース、プロバイダー、機能クラスや、他のエクステンションで登録されたリソース、プロバイダー、機能クラスはフィルタリングされません。最後に、メソッド `getSingletons()` が返すオブジェクトは無視され、リソース、プロバイダー、機能クラスをフィルタリングするためにクラスのみが考慮されます。言い換えれば、メソッド `getSingletons()` は実際には `getClasses()` と同じように管理されます。

source: The RabbitMQ Dev Service will be enabled when the `quarkus-messaging-rabbitmq` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:rabbitmq-dev-services.adoc[RabbitMQ Dev Services Guide].
ja_jp: RabbitMQ Dev Serviceは、アプリケーションに `quarkus-messaging-rabbitmq` エクステンションが存在し、ブローカーアドレスが明示的に設定されていない場合に有効になります。 詳細は xref:rabbitmq-dev-services.adoc[RabbitMQ Dev Servicesガイド] を参照してください。

source: The RabbitMQ Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-rabbitmq` extension is present in your application, and the broker address has not been explicitly configured. More information can be found at the xref:rabbitmq-dev-services.adoc[RabbitMQ Dev Services Guide].
ja_jp: RabbitMQ Dev Serviceは、アプリケーションに `quarkus-smallrye-reactive-messaging-rabbitmq` エクステンションが存在し、ブローカーアドレスが明示的に構成されていない場合に有効になります。詳細については、 link:rabbitmq-dev-services.html[RabbitMQ Dev Services Guide]を参照してください。

source: The RabbitMQ Dev Service will be enabled when the `quarkus-smallrye-reactive-messaging-rabbitmq` extension is present in your application, and the broker address has not been explicitly configured. More information can be found in the xref:rabbitmq-dev-services.adoc[RabbitMQ Dev Services Guide].
ja_jp: RabbitMQ Dev Serviceは、アプリケーションに `quarkus-smallrye-reactive-messaging-rabbitmq` エクステンションが存在し、ブローカーアドレスが明示的に設定されていない場合に有効になります。詳細については、 link:rabbitmq-dev-services.html[RabbitMQ Dev Services Guide]を参照してください。

source: The RabbitMQ connector allows Quarkus applications to send and receive messages using the AMQP 0.9.1 protocol. More details about the protocol can be found in https://www.rabbitmq.com/amqp-0-9-1-reference.html#queue.bind.routing-key[the AMQP 0.9.1 specification].
ja_jp: RabbitMQ コネクターを使用すると、Quarkus アプリケーションは AMQP 0.9.1 プロトコルを使用してメッセージを送受信できます。プロトコルの詳細については、 https://www.rabbitmq.com/amqp-0-9-1-reference.html#queue.bind.routing-key[AMQP 0.9.1 の仕様書] を参照してください。

source: The RabbitMQ connector connects to RabbitMQ brokers. To configure the location and credentials of the broker, add the following properties in the `application.properties`:
ja_jp: RabbitMQ コネクターは RabbitMQ ブローカーに接続します。ブローカーの場所とクレデンシャルを設定するには、 `application.properties` に次のプロパティーを追加します。

source: The RabbitMQ connector is specifically designed for AMQP 0-9-1. While RabbitMQ 4 now supports the AMQP 1.0 protocol, the two protocols are fundamentally different. If you want to communicate with RabbitMQ using AMQP 1.0, we recommend using the xref:amqp-reference.adoc[AMQP 1.0 connector]. Please note that using AMQP 1.0 with RabbitMQ may still have some limitations or reduced functionality compared to native 0-9-1 usage.
ja_jp: RabbitMQ コネクターは、AMQP 0-9-1 専用に設計されています。RabbitMQ 4 は現在 AMQP 1.0 プロトコルをサポートしていますが、これら 2 つのプロトコルは根本的に異なります。AMQP 1.0 を使用して RabbitMQ と通信したい場合は、xref:amqp-reference.adoc[AMQP 1.0 コネクター] を使用することをお勧めします。RabbitMQ で AMQP 1.0 を使用する場合、ネイティブの 0-9-1 の使用と比較して、まだいくつかの制限や機能の低下がある可能性があることに注意してください。

source: The RabbitMQ connector supports AMQP 0-9-1, which is very different from the AMQP 1.0 protocol used by the AMQP 1.0 connector. You can use the AMQP 1.0 connector with RabbitMQ as described in the xref:amqp-reference.adoc[AMQP 1.0 connector reference], albeit with *reduced functionality*.
ja_jp: RabbitMQ コネクターは AMQP 0-9-1 をサポートします。これは、AMQP 1.0 コネクターで使用される AMQP 1.0 プロトコルとは大きく異なります。xref:amqp-reference.adoc[AMQP 1.0 コネクターのリファレンス] で説明されているように、 *機能は縮小* されていますが、AMQP 1.0 コネクターを RabbitMQ で使用できます。

source: The RawBackgroundFunction
ja_jp: RawBackgroundFunction

source: The Reactive Messaging AMQP connector
ja_jp: Reactive Messaging AMQP コネクター

source: The Reactive Messaging RabbitMQ connector
ja_jp: Reactive Messaging RabbitMQコネクター

source: The Reactive Messaging `Message` type lets the consuming method access the incoming message metadata and handle the acknowledgment manually.
ja_jp: Reactive Messaging の `Message` タイプを使用すると、コンシューマーメソッドが着信メッセージのメタデータにアクセスし、確認応答を手動で処理できます。

source: The Reactive Messaging specification defines a CDI-based programming model for implementing event-driven and message-driven applications. Using a small set of annotations, CDI beans become building blocks for implementing interactions with message brokers. These interactions happen through _channels_ where application components read and write messages.
ja_jp: Reactive Messaging 仕様は、イベント駆動型およびメッセージ駆動型のアプリケーションを実装するための CDI ベースのプログラミングモデルを定義します。 少数のアノテーションセットを使用することで、CDI Bean はメッセージブローカーとの対話を実装するための設定要素になります。 これらのやり取りは、アプリケーションコンポーネントがメッセージを読み書きする _チャネル_ を通じて行われます。

source: The Reactive Microsoft SQL Server client now supports encryption.
ja_jp: Reactive Microsoft SQL Server クライアントが暗号化をサポートするようになりました。

source: The Reactive PostgreSQL Client can also prepare queries and take parameters that are replaced in the SQL statement at execution time:
ja_jp: Reactive PostgreSQL Client は、クエリーを準備し、実行時に SQL ステートメントにおいて置き換えられるパラメーターを持つこともできます。

source: The Reactive PostgreSQL Client can be configured with standard Quarkus datasource properties and a reactive URL:
ja_jp: Reactive PostgreSQLクライアントは、Quarkusの標準的なデータソースプロパティーとReactive URLを使用して設定することができます。

source: The Reactive REST Client (`quarkus-rest-client-reactive` and its dependencies) replace the legacy `quarkus-rest-client` but leverage Quarkus' build time processing and the unified I/O model provided by Vert.x.
ja_jp: Reactive REST Client ( `quarkus-rest-client-reactive` とその依存関係) は、レガシー `quarkus-rest-client` を置き換えるものですが、Quarkus のビルド時処理と Vert.x が提供する統一 I/O モデルを活用します。

source: The Reactive REST Client (`quarkus-rest-client-reactive` and its dependencies) replaces the legacy `quarkus-resteasy-client` and leverages Quarkus' build time processing and the unified I/O model provided by Vert.x.
ja_jp: リアクティブRESTクライアント（ `quarkus-rest-client-reactive` とその依存関係）は、従来の `quarkus-resteasy-client` 、Quarkusのビルド時処理とVert.xが提供する統一I/Oモデルを活用します。

source: The Reactive REST Client now supports proxy authentication and global proxy settings.
ja_jp: Reactive REST クライアントがプロキシ認証とグローバルプロキシ設定に対応しました。

source: The Reactive Routes endpoint
ja_jp: Reactive Routesエンドポイント

source: The Reactive SQL Client for Oracle is considered _tech preview_.
ja_jp: Reactive SQL Client for Oracle は、_techpreview_ と見なされます。

source: The Reactive SQL Clients have a straightforward API focusing on scalability and low-overhead. Currently, the following database servers are supported:
ja_jp: Reactive SQL クライアントは、スケーラビリティと低オーバーヘッドに焦点を当てたシンプルな API を持っています。現在、以下のデータベースサーバーがサポートされています。

source: The Reactive SQL Clients now support multiple datasources: you can connect to several databases, exactly in the same way as for JDBC datasources.
ja_jp: Reactive SQL クライアントは複数のデータソースをサポートするようになりました。これによって複数のデータベースに接続できるようになりました。JDBC データソースの場合と全く同じ方法で使用できます。

source: The Red and Blue are two simple REST services serving an endpoint responding `Hello from Red!` and `Hello from Blue!` respectively. The code of both applications has been developed following the https://quarkus.io/guides/getting-started[Getting Started Guide].
ja_jp: Red と Blue は、それぞれ `Hello from Red!` と `Hello from Blue!` に応答すエンドポイントを提供する 2 つの単純な REST サービスです。いずれのアプリケーションのコードも https://quarkus.io/guides/getting-started[入門ガイド] に従い開発されています。

source: The Red and Blue are two simple REST services serving an endpoint responding `Hello from Red!` and `Hello from Blue!` respectively. The code of both applications has been developed following the xref:getting-started.adoc[Getting Started Guide].
ja_jp: レッドとブルーは、それぞれ `Hello from Red!` と `Hello from Blue!` に応答するエンドポイントを提供する2つの単純なRESTサービスです。両方のアプリケーションのコードは、 xref:getting-started.adoc[入門ガイド] に従って開発されています。

source: The Red and Blue service instances behind the `color-service` Kubernetes service.
ja_jp: Kubernetes サービスである `color-service` の背後にある Red と Blue のサービスインスタンス。

source: The Redis Client does not attempt to connect to Redis during application startup.
ja_jp: Redis クライアントは、アプリケーションの起動中に Redis への接続を試行しません。

source: The Redis Client does not contribute a <<redis-health-check,health check>>.
ja_jp: Redis クライアントは <<redis-health-check, ヘルスチェック>> に寄与しません。

source: The Redis Dev Service will be enabled when the `quarkus-redis-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found at the xref:redis-dev-services.adoc[Redis Dev Services Guide].
ja_jp: Redis Dev Serviceは、アプリケーションに `quarkus-redis-client` エクステンションが存在し、サーバー・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:redis-dev-services.html[Redis Dev Services Guide]をご覧ください。

source: The Redis Dev Service will be enabled when the `quarkus-redis-client` extension is present in your application, and the server address has not been explicitly configured. More information can be found in the xref:redis-dev-services.adoc[Redis Dev Services Guide].
ja_jp: Redis Dev Serviceは、アプリケーションに `quarkus-redis-client` エクステンションが存在し、サーバー・アドレスが明示的に設定されていない場合に有効になります。詳細は、 link:redis-dev-services.html[Redis Dev Services ガイド]を参照してください。

source: The Redis backend uses the `<default>` Redis client. See the xref:redis-reference.adoc[Redis reference] to configure the access to Redis.
ja_jp: Redisバックエンドは、 `<default>` Redisクライアントを使用します。Redisへのアクセスを設定するには、 xref:redis-reference.adoc[Redisリファレンス] を参照してください。

source: The Redis client name can be found in the _tags_.
ja_jp: Redisクライアント名は、 _タグ_ で確認できます。

source: The Redis extension allows you to configure multiple clients. Using several clients works the same way as having a single client.
ja_jp: Redis エクステンションを使用すると、複数のクライアントを設定することができます。複数のクライアントを使用しても、単一のクライアントを持つのと同じように動作します。

source: The Redis extension can operate in 4 distinct modes:
ja_jp: Redis エクステンションは、4 つの異なるモードで動作することができます。

source: The Redis extension: exposes an imperative and reactive (Mutiny) APIs to store and retrieve data from a Redis key-value store.
ja_jp: Redisエクステンション: Redisキーバリューストアからデータを保存・取得するための命令型およびリアクティブ型（Mutiny）のAPIを公開しています。

source: The Redis password can be set in the `redis://` URL or with the `quarkus.redis.password` property. We recommend the latter, and if possible, using secrets or an environment variable to configure the password.
ja_jp: Redis のパスワードは、 `redis://` URL で設定するか、 `quarkus.redis.password` プロパティーで設定することができますが、後者での設定をお勧めします。可能であれば、シークレットや環境変数を使ってパスワードを設定することをお勧めします。
